zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXA/periph4/PERI_INPUTMUX.h
/* The count of INPUTMUX_CTIMERC_CTIMER2CAP */
#define INPUTMUX_CTIMERC_CTIMER2CAP_COUNT        (4U)

/*! @name TIMER2TRIG - Trigger register for TIMER2 inputs */
/*! @{ */

#define INPUTMUX_TIMER2TRIG_INP_MASK             (0xFFU)
#define INPUTMUX_TIMER2TRIG_INP_SHIFT            (0U)
/*! INP - Input number for CTIMER2 trigger
 *  0b00000000..Reserved
 *  0b00000001..CT_INP0 input is selected
 *  0b00000010..CT_INP1 input is selected
 *  0b00000011..CT_INP2 input is selected
 *  0b00000100..CT_INP3 input is selected
 *  0b00000101..CT_INP4 input is selected
 *  0b00000110..CT_INP5 input is selected
 *  0b00000111..CT_INP6 input is selected
 *  0b00001000..CT_INP7 input is selected
 *  0b00001001..CT_INP8 input is selected
 *  0b00001010..CT_INP9 input is selected
 *  0b00001011..CT_INP10 input is selected
 *  0b00001100..CT_INP11 input is selected
 *  0b00001101..CT_INP12 input is selected
 *  0b00001110..CT_INP13 input is selected
 *  0b00001111..CT_INP14 input is selected
 *  0b00010000..CT_INP15 input is selected
 *  0b00010001..CT_INP16 input is selected
 *  0b00010010..CT_INP17 input is selected
 *  0b00010011..CT_INP18 input is selected
 *  0b00010100..CT_INP19 input is selected
 *  0b00010101..Reserved
 *  0b00010110..AOI0_OUT0 input is selected
 *  0b00010111..AOI0_OUT1 input is selected
 *  0b00011000..AOI0_OUT2 input is selected
 *  0b00011001..AOI0_OUT3 input is selected
 *  0b00011010..ADC0_tcomp[0]
 *  0b00011011..ADC0_tcomp[1]
 *  0b00011100..ADC0_tcomp[2]
 *  0b00011101..ADC0_tcomp[3] input is selected
 *  0b00011110..CMP0_OUT is selected
 *  0b00011111..Reserved
 *  0b00100000..Reserved
 *  0b00100001..CTimer0_MAT1 input is selected
 *  0b00100010..CTimer0_MAT2 input is selected
 *  0b00100011..CTimer0_MAT3 input is selected
 *  0b00100100..CTimer1_MAT1 input is selected
 *  0b00100101..CTimer1_MAT2 input is selected
 *  0b00100110..CTimer1_MAT3 input is selected
 *  0b00100111..Reserved
 *  0b00101000..Reserved
 *  0b00101001..Reserved
 *  0b00101010..Reserved
 *  0b00101011..Reserved
 *  0b00101100..Reserved
 *  0b00101101..Reserved
 *  0b00101110..Reserved
 *  0b00101111..Reserved
 *  0b00110000..LPI2C0 Master End of Packet input is selected
 *  0b00110001..LPI2C0 Slave End of Packet input is selected
 *  0b00110010..LPI2C1 Master End of Packet input is selected
 *  0b00110011..LPI2C1 Slave End of Packet input is selected
 *  0b00110100..LPSPI0 End of Frame input is selected
 *  0b00110101..LPSPI0 Received Data Word input is selected
 *  0b00110110..LPSPI1 End of Frame input is selected
 *  0b00110111..LPSPI1 Received Data Word input is selected
 *  0b00111000..LPUART0 Received Data Word input is selected
 *  0b00111001..LPUART0 Transmitted Data Word input is selected
 *  0b00111010..LPUART0 Receive Line Idle input is selected
 *  0b00111011..LPUART1 Received Data Word input is selected
 *  0b00111100..LPUART1 Transmitted Data Word input is selected
 *  0b00111101..LPUART1 Receive Line Idle input is selected
 *  0b00111110..LPUART2 Received Data Word input is selected
 *  0b00111111..LPUART2 Transmitted Data Word input is selected
 *  0b01000000..LPUART2 Receive Line Idle input is selected
 *  0b01000001..LPUART3 Received Data Word input is selected
 *  0b01000010..LPUART3 Transmitted Data Word input is selected
 *  0b01000011..LPUART3 Receive Line Idle input is selected
 *  0b01000100..LPUART4 Received Data Word input is selected
 *  0b01000101..LPUART4 Transmitted Data Word input is selected
 *  0b01000110..LPUART4 Receive Line Idle input is selected
 *  0b01000111..Reserved
 *  0b01001000..Reserved
 *  0b01001001..Reserved
 *  0b01001010..Reserved
 *  0b01001011..ADC1_tcomp[0] input is selected
 *  0b01001100..ADC1_tcomp[1] input is selected
 *  0b01001101..ADC1_tcomp[2] input is selected
 *  0b01001110..ADC1_tcomp[3] input is selected
 *  0b01001111..CTimer3_MAT1 input is selected
 *  0b01010000..CTimer3_MAT2 is selected
 *  0b01010001..CTimer3_MAT3 input is selected
 *  0b01010010..CTimer4_MAT1 input is selected
 *  0b01010011..CTimer4_MAT2 input is selected
 *  0b01010100..CTimer4_MAT3 input is selected
 *  0b01010101..Reserved
 *  0b01010110..Reserved
 *  0b01010111..Reserved
 *  0b01011000..Reserved
 *  0b01011001..Reserved
 *  0b01011010..Reserved
 *  0b01011011..Reserved
 *  0b01011100..Reserved
 *  0b01011101..Reserved
 *  0b01011110..LPI2C2 Master End of Packet input is selected
 *  0b01011111..LPI2C2 Slave End of Packet input is selected
 *  0b01100000..LPI2C3 Master End of Packet input is selected
 *  0b01100001..LPI2C3 Slave End of Packet input is selected
 *  0b01100010..LPUART5 Received Data Word input is selected
 *  0b01100011..LPUART5 Transmitted Data Word input is selected
 *  0b01100100..LPUART5 Receive Line Idle input is selected
 *  0b01100101..Reserved
 *  0b01100110..Reserved
 *  0b01100111..Reserved
 *  0b01101000..Reserved
 *  0b01101001..Reserved
 *  0b01101010..Reserved
 *  0b01101011..Reserved
 *  0b01101100..Reserved
 *  0b01101101..Reserved
 *  0b01101110..Reserved
 *  0b01101111..Reserved
 *  0b01110000..Reserved
 *  0b01110001..TRIG_IN0 input is selected
 *  0b01110010..TRIG_IN1 input is selected
 *  0b01110011..TRIG_IN2 input is selected
 *  0b01110100..TRIG_IN3 input is selected
 *  0b01110101..TRIG_IN4 input is selected
 *  0b01110110..TRIG_IN5 input is selected
 *  0b01110111..TRIG_IN6 input is selected
 *  0b01111000..TRIG_IN7 input is selected
 *  0b01111001..TRIG_IN8 input is selected
 *  0b01111010..TRIG_IN9 input is selected
 *  0b01111011..TRIG_IN10 input is selected
 *  0b01111100..TRIG_IN11 input is selected
 *  0b01111101..USB1 Start of Frame input is selected
 *  0b01111110..LPSPI2 End of Frame is selected
 *  0b01111111..LPSPI2 Received Data Word input is selected
 *  0b10000000..LPSPI3 End of Frame input is selected
 *  0b10000001..LPSPI3 Received Data Word input is selected
 *  0b10000010..LPSPI4 End of Frame input is selected
 *  0b10000011..LPSPI4 Received Data Word input is selected
 *  0b10000100..LPSPI5 End of Frame input is selected
 *  0b10000101..LPSPI5 Received Data Word input is selected
 */
#define INPUTMUX_TIMER2TRIG_INP(x)               (((uint32_t)(((uint32_t)(x)) << INPUTMUX_TIMER2TRIG_INP_SHIFT)) & INPUTMUX_TIMER2TRIG_INP_MASK)
/*! @} */

/*! @name SMARTDMA_TRIGGER_INPUTN_SMARTDMA_TRIG - SmartDMA Trigger Input Connections */
/*! @{ */

#define INPUTMUX_SMARTDMA_TRIGGER_INPUTN_SMARTDMA_TRIG_INP_MASK (0x7FU)
#define INPUTMUX_SMARTDMA_TRIGGER_INPUTN_SMARTDMA_TRIG_INP_SHIFT (0U)
/*! INP - Input number for SmartDMA.
 *  0b0000000..Reserved
 *  0b0000001..GPIO P0_16 input is selected
 *  0b0000010..GPIO P0_17 input is selected
 *  0b0000011..GPIO P1_8 input is selected
 *  0b0000100..GPIO P1_9 input is selected
 *  0b0000101..GPIO P1_10 input is selected
 *  0b0000110..GPIO P1_11 input is selected
 *  0b0000111..GPIO P1_12 input is selected
 *  0b0001000..GPIO P1_13 input is selected
 *  0b0001001..GPIO P2_0 input is selected
 *  0b0001010..GPIO P2_1 input is selected
 *  0b0001011..GPIO P2_2 input is selected
 *  0b0001100..GPIO P2_3 input is selected
 *  0b0001101..GPIO P2_6 input is selected
 *  0b0001110..GPIO P3_8 input is selected
 *  0b0001111..GPIO P3_9 input is selected
 *  0b0010000..GPIO P3_10 input is selected
 *  0b0010001..GPIO P3_11 input is selected
 *  0b0010010..GPIO P3_12 input is seclected
 *  0b0010011..GPIO0 Pin Event Trig input is selected
 *  0b0010100..GPIO1 Pin Event Trig input is selected
 *  0b0010101..GPIO2 Pin Event Trig input is selected
 *  0b0010110..GPIO3 Pin Event Trig input is selected
 *  0b0010111..GPIO4 Pin Event Trig input is selected
 *  0b0011000..ARM_TXEV input is selected
 *  0b0011001..AOI0_OUT0 input is selected
 *  0b0011010..Reserved
 *  0b0011011..DMA_IRQ input is selected
 *  0b0011100..Reserved
 *  0b0011101..WUU_IRQ input is selected
 *  0b0011110..CTimer0_MAT2 input is selected
 *  0b0011111..CTimer0_MAT3 input is selected
 *  0b0100000..CTimer1_MAT2 input is selected
 *  0b0100001..CTimer1_MAT3 input is selected
 *  0b0100010..CTimer2_MAT2 input is selected
 *  0b0100011..CTimer2_MAT3 input is selected
 *  0b0100100..CTimer3_MAT2 input is selected
 *  0b0100101..CTimer3_MAT3 input is selected
 *  0b0100110..CTimer4_MAT2 input is selected
 *  0b0100111..CTimer4_MAT3 input is selected
 *  0b0101000..OSTIMER_IRQ input is selected
 *  0b0101001..Reserved
 *  0b0101010..Reserved
 *  0b0101011..Reserved
 *  0b0101100..Reserved
 *  0b0101101..RTC_Alarm_IRQ input is selected
 *  0b0101110..Reserved
 *  0b0101111..uTICK_IRQ input is selected
 *  0b0110000..WDT_IRQ input is selected
 *  0b0110001..Wakeup_Timer_IRQ input is selected
 *  0b0110010..CAN0_IRQ input is selected
 *  0b0110011..CAN1_IRQ input is selected
 *  0b0110100..FlexIO0_IRQ input is selected
 *  0b0110101..FlexIO0_Shifer0_DMA_Req input is selected
 *  0b0110110..FlexIO0_Shifer1_DMA_Req input is selected
 *  0b0110111..FlexIO0_Shifer2_DMA_Req input is selected
 *  0b0111000..FlexIO0_Shifer3_DMA_Req input is selected
 *  0b0111001..I3C0_IRQ input is selected
 *  0b0111010..LPI2C0_IRQ input is selected
 *  0b0111011..LPI2C1_IRQ input is selected
 *  0b0111100..LPSPI0_IRQ input is selected
 *  0b0111101..LPSPI1_IRQ input is selected
 *  0b0111110..LPUART0_IRQ input is selected
 *  0b0111111..LPUART1_IRQ input is selected
 *  0b1000000..LPUART2_IRQ input is selected
 *  0b1000001..LPUART3_IRQ input is selected
 *  0b1000010..Reserved
 *  0b1000011..USB1 Start of Frame input is selected
 *  0b1000100..ADC0_IRQ input is selected
 *  0b1000101..ADC1_IRQ input is selected
 *  0b1000110..Reserved
 *  0b1000111..Reserved
 *  0b1001000..CMP0_IRQ input is selected
 *  0b1001001..Reserved
 *  0b1001010..Reserved
 *  0b1001011..CMP0_OUT input is selected
 *  0b1001100..Reserved
 *  0b1001101..Reserved
 *  0b1001110..DAC0_IRQ input is selected
 *  0b1001111..Reserved
 *  0b1010000..DMA1_IRQ input is selected
 *  0b1010001..DAC1_IRQ input is selected
 *  0b1010010..TSI0_End_of_Scan_IRQ input is selected
 *  0b1010011..TSI0_Out_of_Range_IRQ input is selected
 *  0b1010100..ENET QOS IRQ input is selected
 *  0b1010101..10BASE_T1S IRQ input is selected
 *  0b1010110..ERM Interrupt input is selected
 *  0b1010111..TMPR_OUT0 input is selected
 *  0b1011000..TMPR_OUT1 input is selected
 */
#define INPUTMUX_SMARTDMA_TRIGGER_INPUTN_SMARTDMA_TRIG_INP(x) (((uint32_t)(((uint32_t)(x)) << INPUTMUX_SMARTDMA_TRIGGER_INPUTN_SMARTDMA_TRIG_INP_SHIFT)) & INPUTMUX_SMARTDMA_TRIGGER_INPUTN_SMARTDMA_TRIG_INP_MASK)
/*! @} */

/* The count of INPUTMUX_SMARTDMA_TRIGGER_INPUTN_SMARTDMA_TRIG */
#define INPUTMUX_SMARTDMA_TRIGGER_INPUTN_SMARTDMA_TRIG_COUNT (8U)

/*! @name LPSPI2_TRIG - LPSPI2 trigger input connections */
/*! @{ */

#define INPUTMUX_LPSPI2_TRIG_INP_MASK            (0x3FU)
#define INPUTMUX_LPSPI2_TRIG_INP_SHIFT           (0U)
/*! INP - LPSPI2 trigger input connections
 *  0b000000..Reserved
 *  0b000001..Reserved
 *  0b000010..AOI0_OUT0 input is selected
 *  0b000011..AOI0_OUT1 input is selected
 *  0b000100..AOI0_OUT2 input is selected
 *  0b000101..AOI0_OUT3 input is selected
 *  0b000110..CMP0_OUT input is selected
 *  0b000111..Reserved
 *  0b001000..Reserved
 *  0b001001..CTimer0_MAT1 input is selected
 *  0b001010..CTimer0_MAT2 input is selected
 *  0b001011..CTimer1_MAT1 input is selected
 *  0b001100..CTimer1_MAT2 input is selected
 *  0b001101..CTimer2_MAT1 input is selected
 *  0b001110..CTimer2_MAT2 input is selected
 *  0b001111..LPTMR0 input is selected
 *  0b010000..Reserved
 *  0b010001..TRIG_IN0 input is selected
 *  0b010010..TRIG_IN1 input is selected
 *  0b010011..TRIG_IN2 input is selected
 *  0b010100..TRIG_IN3 input is selected
 *  0b010101..TRIG_IN4 input is selected
 *  0b010110..TRIG_IN5 input is selected
 *  0b010111..TRIG_IN6 input is selected
 *  0b011000..TRIG_IN7 input is selected
 *  0b011001..GPIO0 Pin Event Trig 0 input is selected
 *  0b011010..GPIO1 Pin Event Trig 0 input is selected
 *  0b011011..GPIO2 Pin Event Trig 0 input is selected
 *  0b011100..GPIO3 Pin Event Trig 0 input is selected
 *  0b011101..GPIO4 Pin Event Trig 0 input is selected
 *  0b011110..WUU input is selected
 *  0b011111..Reserved
 *  0b100000..Reserved
 *  0b100001..Reserved
 *  0b100010..Reserved
 *  0b100011..CTimer3_MAT2 inputs is selected
 *  0b100100..CTimer3_MAT3 input is selected
 *  0b100101..CTimer4_MAT2 input is selected
 *  0b100110..CTimer4_MAT3 input is selected
 *  0b100111..FlexIO0 CH0 input is selected
 *  0b101000..FlexIO0 CH1 input is selected
 *  0b101001..FlexIO0 CH2 input is selected
 *  0b101010..FlexIO0 CH3 input is selected
 *  0b101011..GPIO0 Pin Event Trig 1 input is selected
 *  0b101100..GPIO1 Pin Event Trig 1 input is selected
 *  0b101101..GPIO2 Pin Event Trig 1 input is selected
 *  0b101110..GPIO3 Pin Event Trig 1 input is selected
 *  0b101111..GPIO4 Pin Event Trig 1 input is selected
 */
#define INPUTMUX_LPSPI2_TRIG_INP(x)              (((uint32_t)(((uint32_t)(x)) << INPUTMUX_LPSPI2_TRIG_INP_SHIFT)) & INPUTMUX_LPSPI2_TRIG_INP_MASK)
/*! @} */

/*! @name LPSPI3_TRIG - LPSPI3 trigger input connections */
/*! @{ */

#define INPUTMUX_LPSPI3_TRIG_INP_MASK            (0x3FU)
#define INPUTMUX_LPSPI3_TRIG_INP_SHIFT           (0U)
/*! INP - LPSPI3 trigger input connections
 *  0b000000..Reserved
 *  0b000001..Reserved
 *  0b000010..AOI0_OUT0 input is selected
 *  0b000011..AOI0_OUT1 input is selected
 *  0b000100..AOI0_OUT2 input is selected
 *  0b000101..AOI0_OUT3 input is selected
 *  0b000110..CMP0_OUT input is selected
 *  0b000111..Reserved
 *  0b001000..Reserved
 *  0b001001..CTimer0_MAT1 input is selected
 *  0b001010..CTimer0_MAT2 input is selected
 *  0b001011..CTimer1_MAT1 input is selected
 *  0b001100..CTimer1_MAT2 input is selected
 *  0b001101..CTimer2_MAT1 input is selected
 *  0b001110..CTimer2_MAT2 input is selected
 *  0b001111..LPTMR0 input is selected
 *  0b010000..Reserved
 *  0b010001..TRIG_IN0 input is selected
 *  0b010010..TRIG_IN1 input is selected
 *  0b010011..TRIG_IN2 input is selected
 *  0b010100..TRIG_IN3 input is selected
 *  0b010101..TRIG_IN4 input is selected
 *  0b010110..TRIG_IN5 input is selected
 *  0b010111..TRIG_IN6 input is selected
 *  0b011000..TRIG_IN7 input is selected
 *  0b011001..GPIO0 Pin Event Trig 0 input is selected
 *  0b011010..GPIO1 Pin Event Trig 0 input is selected
 *  0b011011..GPIO2 Pin Event Trig 0 input is selected
 *  0b011100..GPIO3 Pin Event Trig 0 input is selected
 *  0b011101..GPIO4 Pin Event Trig 0 input is selected
 *  0b011110..WUU input is selected
 *  0b011111..Reserved
 *  0b100000..Reserved
 *  0b100001..Reserved
 *  0b100010..Reserved
 *  0b100011..CTimer3_MAT2 inputs is selected
 *  0b100100..CTimer3_MAT3 input is selected
 *  0b100101..CTimer4_MAT2 input is selected
 *  0b100110..CTimer4_MAT3 input is selected
 *  0b100111..FlexIO0 CH0 input is selected
 *  0b101000..FlexIO0 CH1 input is selected
 *  0b101001..FlexIO0 CH2 input is selected
 *  0b101010..FlexIO0 CH3 input is selected
 *  0b101011..GPIO0 Pin Event Trig 1 input is selected
 *  0b101100..GPIO1 Pin Event Trig 1 input is selected
 *  0b101101..GPIO2 Pin Event Trig 1 input is selected
 *  0b101110..GPIO3 Pin Event Trig 1 input is selected
 *  0b101111..GPIO4 Pin Event Trig 1 input is selected
 */
#define INPUTMUX_LPSPI3_TRIG_INP(x)              (((uint32_t)(((uint32_t)(x)) << INPUTMUX_LPSPI3_TRIG_INP_SHIFT)) & INPUTMUX_LPSPI3_TRIG_INP_MASK)
/*! @} */

/*! @name LPSPI4_TRIG - LPSPI4 trigger input connections */
/*! @{ */

#define INPUTMUX_LPSPI4_TRIG_INP_MASK            (0x3FU)
#define INPUTMUX_LPSPI4_TRIG_INP_SHIFT           (0U)
/*! INP - LPSPI4 trigger input connections
 *  0b000000..Reserved
 *  0b000001..Reserved
 *  0b000010..AOI0_OUT0 input is selected
 *  0b000011..AOI0_OUT1 input is selected
 *  0b000100..AOI0_OUT2 input is selected
 *  0b000101..AOI0_OUT3 input is selected
 *  0b000110..CMP0_OUT input is selected
 *  0b000111..Reserved
 *  0b001000..Reserved
 *  0b001001..CTimer0_MAT1 input is selected
 *  0b001010..CTimer0_MAT2 input is selected
 *  0b001011..CTimer1_MAT1 input is selected
 *  0b001100..CTimer1_MAT2 input is selected
 *  0b001101..CTimer2_MAT1 input is selected
 *  0b001110..CTimer2_MAT2 input is selected
 *  0b001111..LPTMR0 input is selected
 *  0b010000..Reserved
 *  0b010001..TRIG_IN0 input is selected
 *  0b010010..TRIG_IN1 input is selected
 *  0b010011..TRIG_IN2 input is selected
 *  0b010100..TRIG_IN3 input is selected
 *  0b010101..TRIG_IN4 input is selected
 *  0b010110..TRIG_IN5 input is selected
 *  0b010111..TRIG_IN6 input is selected
 *  0b011000..TRIG_IN7 input is selected
 *  0b011001..GPIO0 Pin Event Trig 0 input is selected
 *  0b011010..GPIO1 Pin Event Trig 0 input is selected
 *  0b011011..GPIO2 Pin Event Trig 0 input is selected
 *  0b011100..GPIO3 Pin Event Trig 0 input is selected
 *  0b011101..GPIO4 Pin Event Trig 0 input is selected
 *  0b011110..WUU input is selected
 *  0b011111..Reserved
 *  0b100000..Reserved
 *  0b100001..Reserved
 *  0b100010..Reserved
 *  0b100011..CTimer3_MAT2 inputs is selected
 *  0b100100..CTimer3_MAT3 input is selected
 *  0b100101..CTimer4_MAT2 input is selected
 *  0b100110..CTimer4_MAT3 input is selected
 *  0b100111..FlexIO0 CH0 input is selected
 *  0b101000..FlexIO0 CH1 input is selected
 *  0b101001..FlexIO0 CH2 input is selected
 *  0b101010..FlexIO0 CH3 input is selected
 *  0b101011..GPIO0 Pin Event Trig 1 input is selected
 *  0b101100..GPIO1 Pin Event Trig 1 input is selected
 *  0b101101..GPIO2 Pin Event Trig 1 input is selected
 *  0b101110..GPIO3 Pin Event Trig 1 input is selected
 *  0b101111..GPIO4 Pin Event Trig 1 input is selected
 */
#define INPUTMUX_LPSPI4_TRIG_INP(x)              (((uint32_t)(((uint32_t)(x)) << INPUTMUX_LPSPI4_TRIG_INP_SHIFT)) & INPUTMUX_LPSPI4_TRIG_INP_MASK)
/*! @} */

/*! @name LPSPI5_TRIG - LPSPI5 trigger input connections */
/*! @{ */

#define INPUTMUX_LPSPI5_TRIG_INP_MASK            (0x3FU)
#define INPUTMUX_LPSPI5_TRIG_INP_SHIFT           (0U)
/*! INP - LPSPI5 trigger input connections
 *  0b000000..Reserved
 *  0b000001..Reserved
 *  0b000010..AOI0_OUT0 input is selected
 *  0b000011..AOI0_OUT1 input is selected
 *  0b000100..AOI0_OUT2 input is selected
 *  0b000101..AOI0_OUT3 input is selected
 *  0b000110..CMP0_OUT input is selected
 *  0b000111..Reserved
 *  0b001000..Reserved
 *  0b001001..CTimer0_MAT1 input is selected
 *  0b001010..CTimer0_MAT2 input is selected
 *  0b001011..CTimer1_MAT1 input is selected
 *  0b001100..CTimer1_MAT2 input is selected
 *  0b001101..CTimer2_MAT1 input is selected
 *  0b001110..CTimer2_MAT2 input is selected
 *  0b001111..LPTMR0 input is selected
 *  0b010000..Reserved
 *  0b010001..TRIG_IN0 input is selected
 *  0b010010..TRIG_IN1 input is selected
 *  0b010011..TRIG_IN2 input is selected
 *  0b010100..TRIG_IN3 input is selected
 *  0b010101..TRIG_IN4 input is selected
 *  0b010110..TRIG_IN5 input is selected
 *  0b010111..TRIG_IN6 input is selected
 *  0b011000..TRIG_IN7 input is selected
 *  0b011001..GPIO0 Pin Event Trig 0 input is selected
 *  0b011010..GPIO1 Pin Event Trig 0 input is selected
 *  0b011011..GPIO2 Pin Event Trig 0 input is selected
 *  0b011100..GPIO3 Pin Event Trig 0 input is selected
 *  0b011101..GPIO4 Pin Event Trig 0 input is selected
 *  0b011110..WUU input is selected
 *  0b011111..Reserved
 *  0b100000..Reserved
 *  0b100001..Reserved
 *  0b100010..Reserved
 *  0b100011..CTimer3_MAT2 inputs is selected
 *  0b100100..CTimer3_MAT3 input is selected
 *  0b100101..CTimer4_MAT2 input is selected
 *  0b100110..CTimer4_MAT3 input is selected
 *  0b100111..FlexIO0 CH0 input is selected
 *  0b101000..FlexIO0 CH1 input is selected
 *  0b101001..FlexIO0 CH2 input is selected
 *  0b101010..FlexIO0 CH3 input is selected
 *  0b101011..GPIO0 Pin Event Trig 1 input is selected
 *  0b101100..GPIO1 Pin Event Trig 1 input is selected
 *  0b101101..GPIO2 Pin Event Trig 1 input is selected
 *  0b101110..GPIO3 Pin Event Trig 1 input is selected
 *  0b101111..GPIO4 Pin Event Trig 1 input is selected
 */
#define INPUTMUX_LPSPI5_TRIG_INP(x)              (((uint32_t)(((uint32_t)(x)) << INPUTMUX_LPSPI5_TRIG_INP_SHIFT)) & INPUTMUX_LPSPI5_TRIG_INP_MASK)
/*! @} */

/*! @name ENET_TRIG_INA_ENET_TRIG_IN - ENET trigger input connections */
/*! @{ */

#define INPUTMUX_ENET_TRIG_INA_ENET_TRIG_IN_INP_MASK (0x1FU)
#define INPUTMUX_ENET_TRIG_INA_ENET_TRIG_IN_INP_SHIFT (0U)
/*! INP - ENET trigger input connections
 *  0b00000..Reserved
 *  0b00001..10BASE-T1S Rx Event Output is selected
 *  0b00010..10BASE-T1S Tx Event Output is selected
 *  0b00011..TRIG_IN0 input is selected
 *  0b00100..TRIG_IN1 input is selected
 *  0b00101..TRIG_IN2 input is selected
 *  0b00110..TRIG_IN3 input is selected
 *  0b00111..TRIG_IN4 input is selected
 *  0b01000..TRIG_IN5 input is selected
 *  0b01001..TRIG_IN6 input is selected
 *  0b01010..TRIG_IN7 input is selected
 *  0b01011..TRIG_IN8 input is selected
 *  0b01100..TRIG_IN9 input is selected
 *  0b01101..TRIG_IN10 input is selected
 *  0b01110..TRIG_IN11 input is selected
 *  0b01111..GPIO0 Pin Event Trig 0 input is selected
 *  0b10000..GPIO1 Pin Event Trig 0 input is selected
 *  0b10001..GPIO2 Pin Event Trig 0 input is selected
 *  0b10010..GPIO3 Pin Event Trig 0 input is selected
 *  0b10011..GPIO4 Pin Event Trig 0 input is selected
 *  0b10100..GPIO0 Pin Event Trig 1 input is selected
 *  0b10101..GPIO1 Pin Event Trig 1 input is selected
 *  0b10110..GPIO2 Pin Event Trig 1 input is selected
 *  0b10111..GPIO3 Pin Event Trig 1 input is selected
 *  0b11000..GPIO4 Pin Event Trig 1 input is selected
 */
#define INPUTMUX_ENET_TRIG_INA_ENET_TRIG_IN_INP(x) (((uint32_t)(((uint32_t)(x)) << INPUTMUX_ENET_TRIG_INA_ENET_TRIG_IN_INP_SHIFT)) & INPUTMUX_ENET_TRIG_INA_ENET_TRIG_IN_INP_MASK)
/*! @} */

/* The count of INPUTMUX_ENET_TRIG_INA_ENET_TRIG_IN */
#define INPUTMUX_ENET_TRIG_INA_ENET_TRIG_IN_COUNT (2U)

/*! @name T1S_WKUP - 10BASE-T1S Local Wake Up connections */
/*! @{ */

