zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXA/periph4/PERI_INPUTMUX.h
#define INPUTMUX_T1S_WKUP_INP_MASK               (0x7FU)
#define INPUTMUX_T1S_WKUP_INP_SHIFT              (0U)
/*! INP - Input number for 10BASE-T1S Local Wake Up
 *  0b0000000..Reserved
 *  0b0000001..AOI0_OUT0 input is selected
 *  0b0000010..AOI0_OUT1 input is selected
 *  0b0000011..AOI0_OUT2 input is selected
 *  0b0000100..AOI0_OUT3 input is selected
 *  0b0000101..ADC0_tcomp[0] input is selected
 *  0b0000110..ADC0_tcomp[1] input is selected
 *  0b0000111..ADC0_tcomp[2] input is selected
 *  0b0001000..ADC0_tcomp[3] input is selected
 *  0b0001001..CMP0_OUT input is selected
 *  0b0001010..Reserved
 *  0b0001011..Reserved
 *  0b0001100..CTimer0_MAT1 input is selected
 *  0b0001101..CTimer0_MAT2 input is selected
 *  0b0001110..CTimer1_MAT1 input is selected
 *  0b0001111..CTimer1_MAT2 input is selected
 *  0b0010000..CTimer2_MAT1 input is selected
 *  0b0010001..CTimer2_MAT2 input is selected
 *  0b0010010..LPTMR0 input is seclected
 *  0b0010011..Reserved
 *  0b0010100..Reserved
 *  0b0010101..Reserved
 *  0b0010110..Reserved
 *  0b0010111..Reserved
 *  0b0011000..TRIG_IN0 input is selected
 *  0b0011001..TRIG_IN1 input is selected
 *  0b0011010..TRIG_IN2 input is selected
 *  0b0011011..TRIG_IN3 input is selected
 *  0b0011100..TRIG_IN4 input is selected
 *  0b0011101..TRIG_IN5 input is selected
 *  0b0011110..TRIG_IN6 input is selected
 *  0b0011111..TRIG_IN7 input is selected
 *  0b0100000..GPIO0 Pin Event Trig 0 input is selected
 *  0b0100001..GPIO1 Pin Event Trig 0 input is selected
 *  0b0100010..GPIO2 Pin Event Trig 0 input is selected
 *  0b0100011..GPIO3 Pin Event Trig 0 input is selected
 *  0b0100100..GPIO4 Pin Event Trig 0 input is selected
 *  0b0100101..Reserved
 *  0b0100110..Reserved
 *  0b0100111..Reserved
 *  0b0101000..Reserved
 *  0b0101001..Reserved
 *  0b0101010..Reserved
 *  0b0101011..LPSPI0 Received Data Word input is selected
 *  0b0101100..Reserved
 *  0b0101101..LPSPI1 Received Data Word input is selected
 *  0b0101110..LPUART0 Received Data Word input is selected
 *  0b0101111..Reserved
 *  0b0110000..Reserved
 *  0b0110001..LPUART1 Received Data Word input is selected
 *  0b0110010..Reserved
 *  0b0110011..Reserved
 *  0b0110100..LPUART2 Received Data Word input is selected
 *  0b0110101..Reserved
 *  0b0110110..Reserved
 *  0b0110111..LPUART3 Received Data Word input is selected
 *  0b0111000..Reserved
 *  0b0111001..Reserved
 *  0b0111010..LPUART4 Received Data Word input is selected
 *  0b0111011..Reserved
 *  0b0111100..Reserved
 *  0b0111101..Reserved
 *  0b0111110..Reserved
 *  0b0111111..Reserved
 *  0b1000000..Reserved
 *  0b1000001..ADC1_tcomp[0] input is selected
 *  0b1000010..ADC1_tcomp[1] input is selected
 *  0b1000011..ADC1_tcomp[2] input is selected
 *  0b1000100..ADC1_tcomp[3] input is selected
 *  0b1000101..CTimer3_MAT2 input is selected
 *  0b1000110..CTimer3_MAT3 input is selected
 *  0b1000111..CTimer4_MAT2 input is selected
 *  0b1001000..CTimer4_MAT3 input is selected
 *  0b1001001..Reserved
 *  0b1001010..Reserved
 *  0b1001011..Reserved
 *  0b1001100..Reserved
 *  0b1001101..Reserved
 *  0b1001110..Reserved
 *  0b1001111..Reserved
 *  0b1010000..Reserved
 *  0b1010001..Reserved
 *  0b1010010..LPSPI2 Received Data Word input is selected
 *  0b1010011..Reserved
 *  0b1010100..LPSPI3 Received Data Word input is selected
 *  0b1010101..GPIO0 Pin Event Trig 1 input is selected
 *  0b1010110..GPIO1 Pin Event Trig 1 input is selected
 *  0b1010111..GPIO2 Pin Event Trig 1 input is selected
 *  0b1011000..GPIO3 Pin Event Trig 1 input is selected
 *  0b1011001..GPIO4 Pin Event Trig 1 input is selected
 */
#define INPUTMUX_T1S_WKUP_INP(x)                 (((uint32_t)(((uint32_t)(x)) << INPUTMUX_T1S_WKUP_INP_SHIFT)) & INPUTMUX_T1S_WKUP_INP_MASK)
/*! @} */

/*! @name FREQMEAS_REF - Selection for frequency measurement reference clock */
/*! @{ */

#define INPUTMUX_FREQMEAS_REF_INP_MASK           (0x3FU)
#define INPUTMUX_FREQMEAS_REF_INP_SHIFT          (0U)
/*! INP - Clock source number (binary value) for frequency measure function reference clock.
 *  0b000000..Reserved
 *  0b000001..clk_in input is selected
 *  0b000010..FRO_OSC_12M input is selected
 *  0b000011..fro_hf_div input is selected
 *  0b000100..OSC32K[1] input is selected
 *  0b000101..clk_16k[1] input is selected
 *  0b000110..SLOW_CLK input is selected
 *  0b000111..FREQME_CLK_IN0 input is selected
 *  0b001000..FREQME_CLK_IN1 input is selected input is selected
 *  0b001001..AOI0_OUT0 input is selected
 *  0b001010..AOI0_OUT1
 *  0b001011..Reserved
 *  0b001100..Reserved
 *  0b001101..Reserved
 *  0b001110..Reserved
 *  0b001111..Reserved
 *  0b010000..Reserved
 *  0b010001..Reserved
 *  0b010010..Reserved
 *  0b011111..pll1_clk_div input is selected
 *  0b100000..Reserved
 *  0b100001..Reserved
 *  0b100010..Reserved
 *  0b100011..Reserved
 *  0b100100..Reserved
 *  0b100101..Reserved
 *  0b100110..Reserved
 *  0b100111..Reserved
 *  0b101000..Reserved
 *  0b101001..Reserved
 */
#define INPUTMUX_FREQMEAS_REF_INP(x)             (((uint32_t)(((uint32_t)(x)) << INPUTMUX_FREQMEAS_REF_INP_SHIFT)) & INPUTMUX_FREQMEAS_REF_INP_MASK)
/*! @} */

/*! @name FREQMEAS_TAR - Selection for frequency measurement reference clock */
/*! @{ */

#define INPUTMUX_FREQMEAS_TAR_INP_MASK           (0x3FU)
#define INPUTMUX_FREQMEAS_TAR_INP_SHIFT          (0U)
/*! INP - Clock source number (binary value) for frequency measure function target clock.
 *  0b000000..Reserved
 *  0b000001..clk_in input is selected
 *  0b000010..FRO_OSC_12M input is selected
 *  0b000011..fro_hf_div input is selected
 *  0b000100..OSC32K[1] input is selected
 *  0b000101..clk_16k[1] input is selected
 *  0b000110..SLOW_CLK input is selected
 *  0b000111..FREQME_CLK_IN0 input is selected
 *  0b001000..FREQME_CLK_IN1 input is selected input is selected
 *  0b001001..AOI0_OUT0 input is selected
 *  0b001010..AOI0_OUT1
 *  0b001011..Reserved
 *  0b001100..Reserved
 *  0b001101..Reserved
 *  0b001110..Reserved
 *  0b001111..Reserved
 *  0b010000..Reserved
 *  0b010001..Reserved
 *  0b010010..Reserved
 *  0b011111..pll1_clk_div input is selected
 *  0b100000..Reserved
 *  0b100001..Reserved
 *  0b100010..Reserved
 *  0b100011..Reserved
 *  0b100100..Reserved
 *  0b100101..Reserved
 *  0b100110..Reserved
 *  0b100111..Reserved
 *  0b101000..Reserved
 *  0b101001..Reserved
 */
#define INPUTMUX_FREQMEAS_TAR_INP(x)             (((uint32_t)(((uint32_t)(x)) << INPUTMUX_FREQMEAS_TAR_INP_SHIFT)) & INPUTMUX_FREQMEAS_TAR_INP_MASK)
/*! @} */

/*! @name CTIMERD_CTIMER3CAP - Capture select register for CTIMER inputs */
/*! @{ */

