zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXA/periph4/PERI_INPUTMUX.h
/*! @name CTIMERE_CTIMER4CAP - Capture select register for CTIMER inputs */
/*! @{ */

#define INPUTMUX_CTIMERE_CTIMER4CAP_INP_MASK     (0xFFU)
#define INPUTMUX_CTIMERE_CTIMER4CAP_INP_SHIFT    (0U)
/*! INP - Input number for CTIMER4
 *  0b00000000..Reserved
 *  0b00000001..CT_INP0 input is selected
 *  0b00000010..CT_INP1 input is selected
 *  0b00000011..CT_INP2 input is selected
 *  0b00000100..CT_INP3 input is selected
 *  0b00000101..CT_INP4 input is selected
 *  0b00000110..CT_INP5 input is selected
 *  0b00000111..CT_INP6 input is selected
 *  0b00001000..CT_INP7 input is selected
 *  0b00001001..CT_INP8 input is selected
 *  0b00001010..CT_INP9 input is selected
 *  0b00001011..CT_INP10 input is selected
 *  0b00001100..CT_INP11 input is selected
 *  0b00001101..CT_INP12 input is selected
 *  0b00001110..CT_INP13 input is selected
 *  0b00001111..CT_INP14 input is selected
 *  0b00010000..CT_INP15 input is selected
 *  0b00010001..CT_INP16 input is selected
 *  0b00010010..CT_INP17 input is selected
 *  0b00010011..CT_INP18 input is selected
 *  0b00010100..CT_INP19 input is selected
 *  0b00010101..Reserved
 *  0b00010110..AOI0_OUT0 input is selected
 *  0b00010111..AOI0_OUT1 input is selected
 *  0b00011000..AOI0_OUT2 input is selected
 *  0b00011001..AOI0_OUT3 input is selected
 *  0b00011010..ADC0_tcomp[0] input is selected
 *  0b00011011..ADC0_tcomp[1] input is selected
 *  0b00011100..ADC0_tcomp[2] input is selected
 *  0b00011101..ADC0_tcomp[3] input is selected
 *  0b00011110..CMP0_OUT is selected
 *  0b00011111..Reserved
 *  0b00100000..Reserved
 *  0b00100001..CTimer0_MAT1 input is selected
 *  0b00100010..CTimer0_MAT2 input is selected
 *  0b00100011..CTimer0_MAT3 input is selected
 *  0b00100100..CTimer1_MAT1 input is selected
 *  0b00100101..CTimer1_MAT2 input is selected
 *  0b00100110..CTimer1_MAT3 input is selected
 *  0b00100111..Reserved
 *  0b00101000..Reserved
 *  0b00101001..Reserved
 *  0b00101010..Reserved
 *  0b00101011..Reserved
 *  0b00101100..Reserved
 *  0b00101101..Reserved
 *  0b00101110..Reserved
 *  0b00101111..Reserved
 *  0b00110000..LPI2C0 Master End of Packet input is selected
 *  0b00110001..LPI2C0 Slave End of Packet input is selected
 *  0b00110010..LPI2C1 Master End of Packet input is selected
 *  0b00110011..LPI2C1 Slave End of Packet input is selected
 *  0b00110100..LPSPI0 End of Frame input is selected
 *  0b00110101..LPSPI0 Received Data Word input is selected
 *  0b00110110..LPSPI1 End of Frame input is selected
 *  0b00110111..LPSPI1 Received Data Word input is selected
 *  0b00111000..LPUART0 Received Data Word input is selected
 *  0b00111001..LPUART0 Transmitted Data Word input is selected
 *  0b00111010..LPUART0 Receive Line Idle input is selected
 *  0b00111011..LPUART1 Received Data Word input is selected
 *  0b00111100..LPUART1 Transmitted Data Word input is selected
 *  0b00111101..LPUART1 Receive Line Idle input is selected
 *  0b00111110..LPUART2 Received Data Word input is selected
 *  0b00111111..LPUART2 Transmitted Data Word input is selected
 *  0b01000000..LPUART2 Receive Line Idle input is selected
 *  0b01000001..LPUART3 Received Data Word input is selected
 *  0b01000010..LPUART3 Transmitted Data Word input is selected
 *  0b01000011..LPUART3 Receive Line Idle input is selected
 *  0b01000100..LPUART4 Received Data Word input is selected
 *  0b01000101..LPUART4 Transmitted Data Word input is selected
 *  0b01000110..LPUART4 Receive Line Idle input is selected
 *  0b01000111..Reserved
 *  0b01001000..Reserved
 *  0b01001001..Reserved
 *  0b01001010..Reserved
 *  0b01001011..ADC1_tcomp[0] input is selected
 *  0b01001100..ADC1_tcomp[1] input is selected
 *  0b01001101..ADC1_tcomp[2] input is selected
 *  0b01001110..ADC1_tcomp[3] input is selected
 *  0b01001111..CTimer2_MAT1 input is selected
 *  0b01010000..CTimer2_MAT2 input is selected
 *  0b01010001..CTimer2_MAT3 input is selected
 *  0b01010010..CTimer3_MAT1 input is selected
 *  0b01010011..CTimer3_MAT2 input is selected
 *  0b01010100..CTimer3_MAT3 input is selected
 *  0b01010101..Reserved
 *  0b01010110..Reserved
 *  0b01010111..Reserved
 *  0b01011000..Reserved
 *  0b01011001..Reserved
 *  0b01011010..Reserved
 *  0b01011011..Reserved
 *  0b01011100..Reserved
 *  0b01011101..Reserved
 *  0b01011110..LPI2C2 Master End of Packet input is selected
 *  0b01011111..LPI2C2 Slave End of Packet input is selected
 *  0b01100000..LPI2C3 Master End of Packet input is selected
 *  0b01100001..LPI2C3 Slave End of Packet input is selected
 *  0b01100010..LPUART5 Received Data Word input is selected
 *  0b01100011..LPUART5 Transmitted Data Word input is selected
 *  0b01100100..LPUART5 Receive Line Idle input is selected
 *  0b01100101..Reserved
 *  0b01100110..TMPR_OUT0 input is selected
 *  0b01100111..TMPR_OUT1 input is selected
 *  0b01101000..Reserved
 *  0b01101001..Reserved
 *  0b01101010..Reserved
 *  0b01101011..Reserved
 *  0b01101100..Reserved
 *  0b01101101..Reserved
 *  0b01101110..Reserved
 *  0b01101111..Reserved
 *  0b01110000..Reserved
 *  0b01110001..TRIG_IN0 input is selected
 *  0b01110010..TRIG_IN1 input is selected
 *  0b01110011..TRIG_IN2 input is selected
 *  0b01110100..TRIG_IN3 input is selected
 *  0b01110101..TRIG_IN4 input is selected
 *  0b01110110..TRIG_IN5 input is selected
 *  0b01110111..TRIG_IN6 input is selected
 *  0b01111000..TRIG_IN7 input is selected
 *  0b01111001..TRIG_IN8 input is selected
 *  0b01111010..TRIG_IN9 input is selected
 *  0b01111011..TRIG_IN10 input is selected
 *  0b01111100..TRIG_IN11 input is selected
 *  0b01111101..USB1 Start of Frame input is selected
 *  0b01111110..LPSPI2 End of Frame input is selected
 *  0b01111111..LPSPI2 Received Data Word input is selected
 *  0b10000000..LPSPI3 End of Frame input is selected
 *  0b10000001..LPSPI3 Received Data Word input is selected
 *  0b10000010..LPSPI4 End of Frame input is selected
 *  0b10000011..LPSPI4 Received Data Word input is selected
 *  0b10000100..LPSPI5 End of Frame input is selected
 *  0b10000101..LPSPI5 Received Data Word input is selected
 */
#define INPUTMUX_CTIMERE_CTIMER4CAP_INP(x)       (((uint32_t)(((uint32_t)(x)) << INPUTMUX_CTIMERE_CTIMER4CAP_INP_SHIFT)) & INPUTMUX_CTIMERE_CTIMER4CAP_INP_MASK)
/*! @} */

