zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXA/periph4/PERI_INPUTMUX.h
/*! @name DAC0_TRIG - DAC0 trigger */
/*! @{ */

#define INPUTMUX_DAC0_TRIG_TRIGIN_MASK           (0x7FU)
#define INPUTMUX_DAC0_TRIG_TRIGIN_SHIFT          (0U)
/*! TRIGIN - This register selects the DAC0 trigger inputs.
 *  0b0000000..Reserved
 *  0b0000001..ARM_TXEV
 *  0b0000010..AOI0_OUT0 input is selected
 *  0b0000011..AOI0_OUT1 input is selected
 *  0b0000100..AOI0_OUT2 input is selected
 *  0b0000101..AOI0_OUT3 input is selected
 *  0b0000110..CMP0_OUT input is selected
 *  0b0000111..Reserved
 *  0b0001000..Reserved
 *  0b0001001..CTimer0_MAT0 input is selected
 *  0b0001010..CTimer0_MAT1 input is selected
 *  0b0001011..CTimer1_MAT0 input is selected
 *  0b0001100..CTimer1_MAT1 input is selected
 *  0b0001101..CTimer2_MAT0 input is selected
 *  0b0001110..CTimer2_MAT1 input is selected
 *  0b0001111..LPTMR0 input is selected
 *  0b0010000..Reserved
 *  0b0010001..Reserved
 *  0b0010010..Reserved
 *  0b0010011..Reserved
 *  0b0010100..Reserved
 *  0b0010101..Reserved
 *  0b0010110..Reserved
 *  0b0010111..Reserved
 *  0b0011000..Reserved
 *  0b0011001..Reserved
 *  0b0011010..GPIO0 Pin Event Trig 0 input is selected
 *  0b0011011..GPIO1 Pin Event Trig 0 input is selected
 *  0b0011100..GPIO2 Pin Event Trig 0 input is selected
 *  0b0011101..GPIO3 Pin Event Trig 0 input is selected
 *  0b0011110..GPIO4 Pin Event Trig 0 input is selected
 *  0b0011111..WUU input is selected
 *  0b0100000..Reserved
 *  0b0100001..Reserved
 *  0b0100010..Reserved
 *  0b0100011..Reserved
 *  0b0100100..Reserved
 *  0b0100101..ADC0_tcomp[0] input is selected
 *  0b0100110..ADC0_tcomp[1] input is selected
 *  0b0100111..ADC1_tcomp[0] input is selected
 *  0b0101000..ADC1_tcomp[1] input is selected
 *  0b0101001..CTimer3_MAT0 input is selected
 *  0b0101010..CTimer3_MAT1 input is selected
 *  0b0101011..CTimer4_MAT0 input is selected
 *  0b0101100..CTimer4_MAT1 input is selected
 *  0b0101101..Reserved
 *  0b0101110..Reserved
 *  0b0101111..Reserved
 *  0b0110000..Reserved
 *  0b0110001..Reserved
 *  0b0110010..Reserved
 *  0b0110011..Reserved
 *  0b0110100..Reserved
 *  0b0110101..Reserved
 *  0b0110110..Reserved
 *  0b0110111..Reserved
 *  0b0111000..Reserved
 *  0b0111001..Reserved
 *  0b0111010..Reserved
 *  0b0111011..Reserved
 *  0b0111100..Reserved
 *  0b0111101..Reserved
 *  0b0111110..GPIO0 Pin Event Trig 1 input is selected
 *  0b0111111..GPIO1 Pin Event Trig 1 input is selected
 *  0b1000000..GPIO2 Pin Event Trig 1 input is selected
 *  0b1000001..GPIO3 Pin Event Trig 1 input is selected
 *  0b1000010..GPIO4 Pin Event Trig 1 input is selected
 */
#define INPUTMUX_DAC0_TRIG_TRIGIN(x)             (((uint32_t)(((uint32_t)(x)) << INPUTMUX_DAC0_TRIG_TRIGIN_SHIFT)) & INPUTMUX_DAC0_TRIG_TRIGIN_MASK)
/*! @} */

/*! @name DAC1_TRIG - DAC1 trigger */
/*! @{ */

#define INPUTMUX_DAC1_TRIG_TRIGIN_MASK           (0x7FU)
#define INPUTMUX_DAC1_TRIG_TRIGIN_SHIFT          (0U)
/*! TRIGIN - This register selects the DAC1 trigger inputs.
 *  0b0000000..Reserved
 *  0b0000001..ARM_TXEV
 *  0b0000010..AOI0_OUT0 input is selected
 *  0b0000011..AOI0_OUT1 input is selected
 *  0b0000100..AOI0_OUT2 input is selected
 *  0b0000101..AOI0_OUT3 input is selected
 *  0b0000110..CMP0_OUT input is selected
 *  0b0000111..Reserved
 *  0b0001000..Reserved
 *  0b0001001..CTimer0_MAT0 input is selected
 *  0b0001010..CTimer0_MAT1 input is selected
 *  0b0001011..CTimer1_MAT0 input is selected
 *  0b0001100..CTimer1_MAT1 input is selected
 *  0b0001101..CTimer2_MAT0 input is selected
 *  0b0001110..CTimer2_MAT1 input is selected
 *  0b0001111..LPTMR0 input is selected
 *  0b0010000..Reserved
 *  0b0010001..Reserved
 *  0b0010010..Reserved
 *  0b0010011..Reserved
 *  0b0010100..Reserved
 *  0b0010101..Reserved
 *  0b0010110..Reserved
 *  0b0010111..Reserved
 *  0b0011000..Reserved
 *  0b0011001..Reserved
 *  0b0011010..GPIO0 Pin Event Trig 0 input is selected
 *  0b0011011..GPIO1 Pin Event Trig 0 input is selected
 *  0b0011100..GPIO2 Pin Event Trig 0 input is selected
 *  0b0011101..GPIO3 Pin Event Trig 0 input is selected
 *  0b0011110..GPIO4 Pin Event Trig 0 input is selected
 *  0b0011111..WUU input is selected
 *  0b0100000..Reserved
 *  0b0100001..Reserved
 *  0b0100010..Reserved
 *  0b0100011..Reserved
 *  0b0100100..Reserved
 *  0b0100101..ADC0_tcomp[0] input is selected
 *  0b0100110..ADC0_tcomp[1] input is selected
 *  0b0100111..ADC1_tcomp[0] input is selected
 *  0b0101000..ADC1_tcomp[1] input is selected
 *  0b0101001..CTimer3_MAT0 input is selected
 *  0b0101010..CTimer3_MAT1 input is selected
 *  0b0101011..CTimer4_MAT0 input is selected
 *  0b0101100..CTimer4_MAT1 input is selected
 *  0b0101101..Reserved
 *  0b0101110..Reserved
 *  0b0101111..Reserved
 *  0b0110000..Reserved
 *  0b0110001..Reserved
 *  0b0110010..Reserved
 *  0b0110011..Reserved
 *  0b0110100..Reserved
 *  0b0110101..Reserved
 *  0b0110110..Reserved
 *  0b0110111..Reserved
 *  0b0111000..Reserved
 *  0b0111001..Reserved
 *  0b0111010..Reserved
 *  0b0111011..Reserved
 *  0b0111100..Reserved
 *  0b0111101..Reserved
 *  0b0111110..GPIO0 Pin Event Trig 1 input is selected
 *  0b0111111..GPIO1 Pin Event Trig 1 input is selected
 *  0b1000000..GPIO2 Pin Event Trig 1 input is selected
 *  0b1000001..GPIO3 Pin Event Trig 1 input is selected
 *  0b1000010..GPIO4 Pin Event Trig 1 input is selected
 */
#define INPUTMUX_DAC1_TRIG_TRIGIN(x)             (((uint32_t)(((uint32_t)(x)) << INPUTMUX_DAC1_TRIG_TRIGIN_SHIFT)) & INPUTMUX_DAC1_TRIG_TRIGIN_MASK)
/*! @} */

/*! @name AOI0_INPUTK_AOI0_INPUT - AOI0 trigger input connections 0 */
/*! @{ */

#define INPUTMUX_AOI0_INPUTK_AOI0_INPUT_INP_MASK (0x7FU)
#define INPUTMUX_AOI0_INPUTK_AOI0_INPUT_INP_SHIFT (0U)
/*! INP - AOI0 trigger input connections
 *  0b0000000..Reserved
 *  0b0000001..ADC0_tcomp[0] input is selected
 *  0b0000010..ADC0_tcomp[1] input is selected
 *  0b0000011..ADC0_tcomp[2] input is selected
 *  0b0000100..ADC0_tcomp[3] input is selected
 *  0b0000101..CMP0_OUT input is selected
 *  0b0000110..Reserved
 *  0b0000111..Reserved
 *  0b0001000..CTimer0_MAT0 input is selected
 *  0b0001001..CTimer0_MAT1 input is selected
 *  0b0001010..CTimer0_MAT2 input is selected
 *  0b0001011..CTimer0_MAT3 input is selected
 *  0b0001100..CTimer1_MAT0 input is selected
 *  0b0001101..CTimer1_MAT1 input is selected
 *  0b0001110..CTimer1_MAT2 input is selected
 *  0b0001111..CTimer1_MAT3 input is selected
 *  0b0010000..CTimer2_MAT0 input is selected
 *  0b0010001..CTimer2_MAT1 input is selected
 *  0b0010010..CTimer2_MAT2 input is selected
 *  0b0010011..CTimer2_MAT3 input is selected
 *  0b0010100..LPTMR0 input is selected
 *  0b0010101..Reserved
 *  0b0010110..Reserved
 *  0b0010111..Reserved
 *  0b0011000..Reserved
 *  0b0011001..Reserved
 *  0b0011010..Reserved
 *  0b0011011..Reserved
 *  0b0011100..Reserved
 *  0b0011101..Reserved
 *  0b0011110..Reserved
 *  0b0011111..Reserved
 *  0b0100000..Reserved
 *  0b0100001..Reserved
 *  0b0100010..Reserved
 *  0b0100011..TRIG_IN0 input is selected
 *  0b0100100..TRIG_IN1 input is selected
 *  0b0100101..TRIG_IN2 input is selected
 *  0b0100110..TRIG_IN3 input is selected
 *  0b0100111..TRIG_IN4 input is selected
 *  0b0101000..TRIG_IN5 input is selected
 *  0b0101001..TRIG_IN6 input is selected
 *  0b0101010..TRIG_IN7 input is selected
 *  0b0101011..TRIG_IN8 input is selected
 *  0b0101100..TRIG_IN9 input is selected
 *  0b0101101..TRIG_IN10 input is selected
 *  0b0101110..TRIG_IN11 input is selected
 *  0b0101111..GPIO0 Pin Event Trig 0 input is selected
 *  0b0110000..GPIO1 Pin Event Trig 0 input is selected
 *  0b0110001..GPIO2 Pin Event Trig 0 input is selected
 *  0b0110010..GPIO3 Pin Event Trig 0 input is selected
 *  0b0110011..GPIO4 Pin Event Trig 0 input is selected
 *  0b0110100..ADC1_tcomp[0] input is selected
 *  0b0110101..ADC1_tcomp[1] input is selected
 *  0b0110110..ADC1_tcomp[2] input is selected
 *  0b0110111..ADC1_tcomp[3] input is selected
 *  0b0111000..CTimer3_MAT0 input is selected
 *  0b0111001..CTimer3_MAT1 input is selected
 *  0b0111010..CTimer3_MAT2 input is selected
 *  0b0111011..CTimer3_MAT3 input is selected
 *  0b0111100..CTimer4_MAT0 input is selected
 *  0b0111101..CTimer4_MAT1 input is selected
 *  0b0111110..CTimer4_MAT2 input is selected
 *  0b0111111..CTimer4_MAT3 input is selected
 *  0b1000000..FlexIO CH0 input is selected
 *  0b1000001..FlexIO CH1 input is selected
 *  0b1000010..FlexIO CH2 input is selected
 *  0b1000011..FlexIO CH3 input is selected
 *  0b1000100..Reserved
 *  0b1000101..Reserved
 *  0b1000110..Reserved
 *  0b1000111..Reserved
 *  0b1001000..Reserved
 *  0b1001001..Reserved
 *  0b1001010..Reserved
 *  0b1001011..Reserved
 *  0b1001100..Reserved
 *  0b1001101..Reserved
 *  0b1001110..Reserved
 *  0b1001111..Reserved
 *  0b1010000..Reserved
 *  0b1010001..Reserved
 *  0b1010010..Reserved
 *  0b1010011..Reserved
 *  0b1010100..Reserved
 *  0b1010101..Reserved
 *  0b1010110..Reserved
 *  0b1010111..Reserved
 *  0b1011000..Reserved
 *  0b1011001..Reserved
 *  0b1011010..Reserved
 *  0b1011011..Reserved
 *  0b1011100..Reserved
 *  0b1011101..Reserved
 *  0b1011110..Reserved
 *  0b1011111..Reserved
 *  0b1100000..Reserved
 *  0b1100001..GPIO0 Pin Event Trig 1 input is selected
 *  0b1100010..GPIO1 Pin Event Trig 1 input is selected
 *  0b1100011..GPIO2 Pin Event Trig 1 input is selected
 *  0b1100100..GPIO3 Pin Event Trig 1 input is selected
 *  0b1100101..GPIO4 Pin Event Trig 1 input is selected
 */
#define INPUTMUX_AOI0_INPUTK_AOI0_INPUT_INP(x)   (((uint32_t)(((uint32_t)(x)) << INPUTMUX_AOI0_INPUTK_AOI0_INPUT_INP_SHIFT)) & INPUTMUX_AOI0_INPUTK_AOI0_INPUT_INP_MASK)
/*! @} */

/* The count of INPUTMUX_AOI0_INPUTK_AOI0_INPUT */
#define INPUTMUX_AOI0_INPUTK_AOI0_INPUT_COUNT    (16U)

