zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXA/periph4/PERI_INPUTMUX.h
/*! @name TSI0_TRIG_INPUT - TSI0 trigger input connections */
/*! @{ */

#define INPUTMUX_TSI0_TRIG_INPUT_INP_MASK        (0xFU)
#define INPUTMUX_TSI0_TRIG_INPUT_INP_SHIFT       (0U)
/*! INP - TSI0 trigger input connections
 *  0b0000..Reserved
 *  0b0001..CTimer0_MAT2 input is selected
 *  0b0010..CTimer0_MAT3 input is selected
 *  0b0011..CTimer1_MAT2 input is selected
 *  0b0100..CTimer1_MAT3 input is selected
 *  0b0101..CTimer2_MAT2 input is selected
 *  0b0110..CTimer2_MAT3 input is selected
 *  0b0111..CTimer3_MAT2 input is selected
 *  0b1000..CTimer3_MAT3 input is selected
 *  0b1001..CTimer4_MAT2 input is selected
 *  0b1010..CTimer4_MAT3 input is selected
 *  0b1011..LPTMR0 input is selected
 *  0b1100..WUU input is selected
 */
#define INPUTMUX_TSI0_TRIG_INPUT_INP(x)          (((uint32_t)(((uint32_t)(x)) << INPUTMUX_TSI0_TRIG_INPUT_INP_SHIFT)) & INPUTMUX_TSI0_TRIG_INPUT_INP_MASK)
/*! @} */

/*! @name EXT_TRIGN_TRIG_OUT - EXT trigger connections */
/*! @{ */

#define INPUTMUX_EXT_TRIGN_TRIG_OUT_INP_MASK     (0x1FU)
#define INPUTMUX_EXT_TRIGN_TRIG_OUT_INP_SHIFT    (0U)
/*! INP - EXT trigger input connections
 *  0b00000..Reserved
 *  0b00001..Reserved
 *  0b00010..AOI0_OUT0 input is selected
 *  0b00011..AOI0_OUT1 input is selected
 *  0b00100..AOI0_OUT2 input is selected
 *  0b00101..AOI0_OUT3 input is selected
 *  0b00110..CMP0_OUT input is selected
 *  0b00111..Reserved
 *  0b01000..Reserved
 *  0b01001..LPUART0 ipp_do_lpuart_txd input is selected
 *  0b01010..LPUART1 ipp_do_lpuart_txd input is selected
 *  0b01011..LPUART2 ipp_do_lpuart_txd input is selected
 *  0b01100..LPUART3 ipp_do_lpuart_txd input is selected
 *  0b01101..LPUART4 ipp_do_lpuart_txd input is selected
 *  0b01110..Reserved
 *  0b01111..Reserved
 *  0b10000..Reserved
 *  0b10001..Reserved
 *  0b10010..LPUART5 ipp_do_lpuart_txd input is selected
 *  0b10011..Reserved
 *  0b10100..Reserved
 *  0b10101..USB1 Start of Frame input is selected
 *  0b10110..ENET PPS Output input is selected
 */
#define INPUTMUX_EXT_TRIGN_TRIG_OUT_INP(x)       (((uint32_t)(((uint32_t)(x)) << INPUTMUX_EXT_TRIGN_TRIG_OUT_INP_SHIFT)) & INPUTMUX_EXT_TRIGN_TRIG_OUT_INP_MASK)
/*! @} */

/* The count of INPUTMUX_EXT_TRIGN_TRIG_OUT */
#define INPUTMUX_EXT_TRIGN_TRIG_OUT_COUNT        (8U)

/*! @name LPI2C2_TRIG - LPI2C2 trigger input connections */
/*! @{ */

#define INPUTMUX_LPI2C2_TRIG_INP_MASK            (0x3FU)
#define INPUTMUX_LPI2C2_TRIG_INP_SHIFT           (0U)
/*! INP - LPI2C2 trigger input connections
 *  0b000000..Reserved
 *  0b000001..Reserved
 *  0b000010..AOI0_OUT0 input is selected
 *  0b000011..AOI0_OUT1 input is selected
 *  0b000100..AOI0_OUT2 input is selected
 *  0b000101..AOI0_OUT3 input is selected
 *  0b000110..CMP0_OUT input is selected
 *  0b000111..Reserved
 *  0b001000..Reserved
 *  0b001001..CTimer0_MAT0 input is selected
 *  0b001010..CTimer0_MAT1 input is selected
 *  0b001011..CTimer1_MAT0 input is selected
 *  0b001100..CTimer1_MAT1 input is selected
 *  0b001101..CTimer2_MAT0 input is selected
 *  0b001110..CTimer2_MAT1 input is selected
 *  0b001111..LPTMR0 input is selected
 *  0b010000..Reserved
 *  0b010001..TRIG_IN0 input is selected
 *  0b010010..TRIG_IN1 input is selected
 *  0b010011..TRIG_IN2 input is selected
 *  0b010100..TRIG_IN3 input is selected
 *  0b010101..TRIG_IN4 input is selected
 *  0b010110..TRIG_IN5 input is selected
 *  0b010111..TRIG_IN6 input is selected
 *  0b011000..TRIG_IN7 input is selected
 *  0b011001..GPIO0 Pin Event Trig 0 input is selected
 *  0b011010..GPIO1 Pin Event Trig 0 input is selected
 *  0b011011..GPIO2 Pin Event Trig 0 input is selected
 *  0b011100..GPIO3 Pin Event Trig 0 input is selected
 *  0b011101..GPIO4 Pin Event Trig 0 input is selected
 *  0b011110..WUU input is selected
 *  0b011111..Reserved
 *  0b100000..Reserved
 *  0b100001..Reserved
 *  0b100010..Reserved
 *  0b100011..CTimer3_MAT2 input is selected
 *  0b100100..CTimer3_MAT3 input is selected
 *  0b100101..CTimer4_MAT2 input is selected
 *  0b100110..CTimer4_MAT3 input is selected
 *  0b100111..FlexIO0 CH0 input is selected
 *  0b101000..FlexIO0 CH1 input is selected
 *  0b101001..FlexIO0 CH2 input is selected
 *  0b101010..FlexIO0 CH3 input is selected
 *  0b101011..GPIO0 Pin Event Trig 1 input is selected
 *  0b101100..GPIO1 Pin Event Trig 1 input is selected
 *  0b101101..GPIO2 Pin Event Trig 1 input is selected
 *  0b101110..GPIO3 Pin Event Trig 1 input is selected
 *  0b101111..GPIO4 Pin Event Trig 1 input is selected
 */
#define INPUTMUX_LPI2C2_TRIG_INP(x)              (((uint32_t)(((uint32_t)(x)) << INPUTMUX_LPI2C2_TRIG_INP_SHIFT)) & INPUTMUX_LPI2C2_TRIG_INP_MASK)
/*! @} */

/*! @name LPI2C3_TRIG - LPI2C3 trigger input connections */
/*! @{ */

#define INPUTMUX_LPI2C3_TRIG_INP_MASK            (0x3FU)
#define INPUTMUX_LPI2C3_TRIG_INP_SHIFT           (0U)
/*! INP - LPI2C3 trigger input connections
 *  0b000000..Reserved
 *  0b000001..Reserved
 *  0b000010..AOI0_OUT0 input is selected
 *  0b000011..AOI0_OUT1 input is selected
 *  0b000100..AOI0_OUT2 input is selected
 *  0b000101..AOI0_OUT3 input is selected
 *  0b000110..CMP0_OUT input is selected
 *  0b000111..Reserved
 *  0b001000..Reserved
 *  0b001001..CTimer0_MAT0 input is selected
 *  0b001010..CTimer0_MAT1 input is selected
 *  0b001011..CTimer1_MAT0 input is selected
 *  0b001100..CTimer1_MAT1 input is selected
 *  0b001101..CTimer2_MAT0 input is selected
 *  0b001110..CTimer2_MAT1 input is selected
 *  0b001111..LPTMR0 input is selected
 *  0b010000..Reserved
 *  0b010001..TRIG_IN0 input is selected
 *  0b010010..TRIG_IN1 input is selected
 *  0b010011..TRIG_IN2 input is selected
 *  0b010100..TRIG_IN3 input is selected
 *  0b010101..TRIG_IN4 input is selected
 *  0b010110..TRIG_IN5 input is selected
 *  0b010111..TRIG_IN6 input is selected
 *  0b011000..TRIG_IN7 input is selected
 *  0b011001..GPIO0 Pin Event Trig 0 input is selected
 *  0b011010..GPIO1 Pin Event Trig 0 input is selected
 *  0b011011..GPIO2 Pin Event Trig 0 input is selected
 *  0b011100..GPIO3 Pin Event Trig 0 input is selected
 *  0b011101..GPIO4 Pin Event Trig 0 input is selected
 *  0b011110..WUU input is selected
 *  0b011111..Reserved
 *  0b100000..Reserved
 *  0b100001..Reserved
 *  0b100010..Reserved
 *  0b100011..CTimer3_MAT2 input is selected
 *  0b100100..CTimer3_MAT3 input is selected
 *  0b100101..CTimer4_MAT2 input is selected
 *  0b100110..CTimer4_MAT3 input is selected
 *  0b100111..FlexIO0 CH0 input is selected
 *  0b101000..FlexIO0 CH1 input is selected
 *  0b101001..FlexIO0 CH2 input is selected
 *  0b101010..FlexIO0 CH3 input is selected
 *  0b101011..GPIO0 Pin Event Trig 1 input is selected
 *  0b101100..GPIO1 Pin Event Trig 1 input is selected
 *  0b101101..GPIO2 Pin Event Trig 1 input is selected
 *  0b101110..GPIO3 Pin Event Trig 1 input is selected
 *  0b101111..GPIO4 Pin Event Trig 1 input is selected
 */
#define INPUTMUX_LPI2C3_TRIG_INP(x)              (((uint32_t)(((uint32_t)(x)) << INPUTMUX_LPI2C3_TRIG_INP_SHIFT)) & INPUTMUX_LPI2C3_TRIG_INP_MASK)
/*! @} */

/*! @name LPI2C4_TRIG - LPI2C4 trigger input connections */
/*! @{ */

#define INPUTMUX_LPI2C4_TRIG_INP_MASK            (0x3FU)
#define INPUTMUX_LPI2C4_TRIG_INP_SHIFT           (0U)
/*! INP - LPI2C4 trigger input connections
 *  0b000000..Reserved
 *  0b000001..Reserved
 *  0b000010..AOI0_OUT0 input is selected
 *  0b000011..AOI0_OUT1 input is selected
 *  0b000100..AOI0_OUT2 input is selected
 *  0b000101..AOI0_OUT3 input is selected
 *  0b000110..CMP0_OUT input is selected
 *  0b000111..Reserved
 *  0b001000..Reserved
 *  0b001001..CTimer0_MAT0 input is selected
 *  0b001010..CTimer0_MAT1 input is selected
 *  0b001011..CTimer1_MAT0 input is selected
 *  0b001100..CTimer1_MAT1 input is selected
 *  0b001101..CTimer2_MAT0 input is selected
 *  0b001110..CTimer2_MAT1 input is selected
 *  0b001111..LPTMR0 input is selected
 *  0b010000..Reserved
 *  0b010001..TRIG_IN0 input is selected
 *  0b010010..TRIG_IN1 input is selected
 *  0b010011..TRIG_IN2 input is selected
 *  0b010100..TRIG_IN3 input is selected
 *  0b010101..TRIG_IN4 input is selected
 *  0b010110..TRIG_IN5 input is selected
 *  0b010111..TRIG_IN6 input is selected
 *  0b011000..TRIG_IN7 input is selected
 *  0b011001..GPIO0 Pin Event Trig 0 input is selected
 *  0b011010..GPIO1 Pin Event Trig 0 input is selected
 *  0b011011..GPIO2 Pin Event Trig 0 input is selected
 *  0b011100..GPIO3 Pin Event Trig 0 input is selected
 *  0b011101..GPIO4 Pin Event Trig 0 input is selected
 *  0b011110..WUU input is selected
 *  0b011111..Reserved
 *  0b100000..Reserved
 *  0b100001..Reserved
 *  0b100010..Reserved
 *  0b100011..CTimer3_MAT2 input is selected
 *  0b100100..CTimer3_MAT3 input is selected
 *  0b100101..CTimer4_MAT2 input is selected
 *  0b100110..CTimer4_MAT3 input is selected
 *  0b100111..FlexIO0 CH0 input is selected
 *  0b101000..FlexIO0 CH1 input is selected
 *  0b101001..FlexIO0 CH2 input is selected
 *  0b101010..FlexIO0 CH3 input is selected
 *  0b101011..GPIO0 Pin Event Trig 1 input is selected
 *  0b101100..GPIO1 Pin Event Trig 1 input is selected
 *  0b101101..GPIO2 Pin Event Trig 1 input is selected
 *  0b101110..GPIO3 Pin Event Trig 1 input is selected
 *  0b101111..GPIO4 Pin Event Trig 1 input is selected
 */
#define INPUTMUX_LPI2C4_TRIG_INP(x)              (((uint32_t)(((uint32_t)(x)) << INPUTMUX_LPI2C4_TRIG_INP_SHIFT)) & INPUTMUX_LPI2C4_TRIG_INP_MASK)
/*! @} */

/*! @name LPI2C0_TRIG - LPI2C0 trigger input connections */
/*! @{ */

#define INPUTMUX_LPI2C0_TRIG_INP_MASK            (0x3FU)
#define INPUTMUX_LPI2C0_TRIG_INP_SHIFT           (0U)
/*! INP - LPI2C0 trigger input connections
 *  0b000000..Reserved
 *  0b000001..Reserved
 *  0b000010..AOI0_OUT0 input is selected
 *  0b000011..AOI0_OUT1 input is selected
 *  0b000100..AOI0_OUT2 input is selected
 *  0b000101..AOI0_OUT3 input is selected
 *  0b000110..CMP0_OUT input is selected
 *  0b000111..Reserved
 *  0b001000..Reserved
 *  0b001001..CTimer0_MAT0 input is selected
 *  0b001010..CTimer0_MAT1 input is selected
 *  0b001011..CTimer1_MAT0 input is selected
 *  0b001100..CTimer1_MAT1 input is selected
 *  0b001101..CTimer2_MAT0 input is selected
 *  0b001110..CTimer2_MAT1 input is selected
 *  0b001111..LPTMR0 input is selected
 *  0b010000..Reserved
 *  0b010001..TRIG_IN0 input is selected
 *  0b010010..TRIG_IN1 input is selected
 *  0b010011..TRIG_IN2 input is selected
 *  0b010100..TRIG_IN3 input is selected
 *  0b010101..TRIG_IN4 input is selected
 *  0b010110..TRIG_IN5 input is selected
 *  0b010111..TRIG_IN6 input is selected
 *  0b011000..TRIG_IN7 input is selected
 *  0b011001..GPIO0 Pin Event Trig 0 input is selected
 *  0b011010..GPIO1 Pin Event Trig 0 input is selected
 *  0b011011..GPIO2 Pin Event Trig 0 input is selected
 *  0b011100..GPIO3 Pin Event Trig 0 input is selected
 *  0b011101..GPIO4 Pin Event Trig 0 input is selected
 *  0b011110..WUU input is selected
 *  0b011111..Reserved
 *  0b100000..Reserved
 *  0b100001..Reserved
 *  0b100010..Reserved
 *  0b100011..CTimer3_MAT2 input is selected
 *  0b100100..CTimer3_MAT3 input is selected
 *  0b100101..CTimer4_MAT2 input is selected
 *  0b100110..CTimer4_MAT3 input is selected
 *  0b100111..FlexIO0 CH0 input is selected
 *  0b101000..FlexIO0 CH1 input is selected
 *  0b101001..FlexIO0 CH2 input is selected
 *  0b101010..FlexIO0 CH3 input is selected
 *  0b101011..GPIO0 Pin Event Trig 1 input is selected
 *  0b101100..GPIO1 Pin Event Trig 1 input is selected
 *  0b101101..GPIO2 Pin Event Trig 1 input is selected
 *  0b101110..GPIO3 Pin Event Trig 1 input is selected
 *  0b101111..GPIO4 Pin Event Trig 1 input is selected
 */
#define INPUTMUX_LPI2C0_TRIG_INP(x)              (((uint32_t)(((uint32_t)(x)) << INPUTMUX_LPI2C0_TRIG_INP_SHIFT)) & INPUTMUX_LPI2C0_TRIG_INP_MASK)
/*! @} */

